# SaveLocalBefore Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SynchronizeWithCentralOptions..::..SaveLocalBefore Property
SynchronizeWithCentralOptions Class See Also
---
True means to save local before the first reload latest if there are changes not yet saved to local. True by default. Silently ignored if the model in the current session is central rather than local.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool SaveLocalBefore { get; set; }
```

Visual Basic
---
```text
Public Property SaveLocalBefore As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SaveLocalBefore {
	bool get ();
	void set (bool value);
}
```

# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace